In [9]:
import pandas as pd
import matplotlib.pyplot as plt
import os

In [2]:
#!pip3 install matplotlib

### Load 'titanic_train.csv' CSV file and save last 5 rows in Excel format

In [10]:
os.getcwd()

'C:\\Users\\Sergio\\worksplace\\day_9'

In [15]:
df = pd.read_csv("files_pandas_21_01_2017/titanic_train.csv")
df.tail(5).to_csv("titani_last_5_passenger.csv", index=False)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Load Excel file from previous exercise and save it again with only first four columns

In [23]:
df = pd.read_csv("files_pandas_21_01_2017/titanic_train.csv")
df.columns
df[['Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']].to_excel("titani_last_5_columns.xlsx", index=False)
df = pd.read_excel("files_pandas_21_01_2017/titanic_last_5_4_cols.xlsx")
df

,Unnamed: 0,PassengerId,Survived,Pclass,Name
0,886,887,0,2,"Montvila, Rev. Juozas"
1,887,888,1,1,"Graham, Miss. Margaret Edith"
2,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
3,889,890,1,1,"Behr, Mr. Karl Howell"
4,890,891,0,3,"Dooley, Mr. Patrick"

### Test how loc and iloc works (be creative :) )

### ZaÅ‚aduj plik csv z `titanic_train.csv` z folderu `files_pandas_21_01_2017`

In [24]:
df = pd.read_csv("files_pandas_21_01_2017/titanic_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### SprawdÅº pierwsze wiersze

In [25]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

#### Policz wystÄ…pienia wartoÅ›ci zmiennej survived

In [28]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

#### SprawdÅº typy danych

In [32]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# WrÃ³Ä‡my do wykÅ‚adu - Zmiana typÃ³w danych w czasie odczytu

## Exercises

### Load 'titanic_train.csv' file, with category type for all columns that are compatible with this type.

### Fill NaN values in Age column with mean value of this column.

### Fill NaN values in Embarked with most common location.

### Create 3 Series with different indexes that overlap a bit (i.e. 1-10, 5-15, 10-20). Create DataFrame from them and see what happens.

### Display passengers with Age above 50

### Display passengers that Embarked at location S and are female

### Display passengers that paid for ticket more than 50 and are not in first class

### Display all passengers with Names that contain 'Johnson' (it's a surname)

# Dodatkowe Ä‡wiczenia

KorzystajÄ…c z pliku `matches.csv` zawierajÄ…cego dane o rozgrywkach piÅ‚karskich:

1. ZnajdÅº wszystkie mecze pomiÄ™dzy dwoma wybranymi druÅ¼ynami w latach 2010-2015.\
2. ZnajdÅº 10 meczÃ³w z najwiÄ™kszÄ… rÃ³Å¼nicÄ… bramek.
3. Policz liczbÄ™ zdobytych i straconych bramek na sezon dla wybranej druÅ¼yny. Narysuj wykres obrazujÄ…cy uzyskane wyniki.
4. Policz Å›redniÄ… liczbÄ™ bramek przypadajÄ…cÄ… na jeden mecz w kaÅ¼dej lidze. Narysuj wykres obrazujÄ…cy uzyskane wyniki.